euyju/VibeClean/HW/STM32/Core/Src/main.c
    return distance;
}

/* 안전한 방향 제어 함수 */
void set_motor_direction(uint8_t motor_id, uint8_t direction)
{
    GPIO_TypeDef *in1_port = NULL, *in2_port = NULL;
    uint16_t in1_pin = 0, in2_pin = 0;

    if (motor_id == MOTOR_A) {
        in1_port = M1_IN1_PORT;
        in2_port = M1_IN2_PORT;
        in1_pin  = M1_IN1_PIN;
        in2_pin  = M1_IN2_PIN;
    } else if (motor_id == MOTOR_B) {
        in1_port = M2_IN1_PORT;
        in2_port = M2_IN2_PORT;
        in1_pin  = M2_IN1_PIN;
        in2_pin  = M2_IN2_PIN;
    }else if (motor_id == MOTOR_C) {
        in1_port = M3_IN1_PORT;
        in2_port = M3_IN2_PORT;
        in1_pin  = M3_IN1_PIN;
        in2_pin  = M3_IN2_PIN;
    }
    else {
        return;
    }

    if (direction == FORWARD) {
        HAL_GPIO_WritePin(in1_port, in1_pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(in2_port, in2_pin, GPIO_PIN_RESET);

    } else if (direction == BACKWARD) {
        HAL_GPIO_WritePin(in1_port, in1_pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(in2_port, in2_pin, GPIO_PIN_SET);
    }
    else if (direction == BACKWARD) {
           HAL_GPIO_WritePin(in1_port, in1_pin, GPIO_PIN_RESET);
           HAL_GPIO_WritePin(in2_port, in2_pin, GPIO_PIN_SET);
       }
    else { // STOP (coast)
        HAL_GPIO_WritePin(in1_port, in1_pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(in2_port, in2_pin, GPIO_PIN_RESET);
    }
}


/* 속도 설정은 그대로 사용하되 PWM_MAX와 TIM1 ARR 일치 확인 필요 */
void set_motor_speed(uint8_t motor_id, uint16_t speed)
{
    if (speed > PWM_MAX_VALUE) speed = PWM_MAX_VALUE;

    if (motor_id == MOTOR_A) {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, speed);
    } else if (motor_id == MOTOR_B) {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, speed);
    } else if (motor_id == MOTOR_C) {
        __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, speed);
    }

}

/* --- 모터 제어 유틸 함수 추가 --- */
void stop_all_motors(void)
{
    set_motor_speed(MOTOR_A, 0);
    set_motor_speed(MOTOR_B, 0);
    set_motor_speed(MOTOR_C, 0);

    set_motor_direction(MOTOR_A, STOP);
    set_motor_direction(MOTOR_B, STOP);
    set_motor_direction(MOTOR_C, STOP);
}

void move_forward_pwm(uint16_t pwm)
{
    set_motor_direction(MOTOR_A, FORWARD);
    set_motor_direction(MOTOR_B, FORWARD);
    set_motor_speed(MOTOR_A, pwm);
    set_motor_speed(MOTOR_B, pwm);
}

void move_backward_pwm(uint16_t pwm)
{
    set_motor_direction(MOTOR_A, BACKWARD);
    set_motor_direction(MOTOR_B, BACKWARD);
    set_motor_speed(MOTOR_A, pwm);
    set_motor_speed(MOTOR_B, pwm);
}

void rotate_right_inplace(uint16_t pwm) // 오른쪽으로 제자리 회전 (좌/우 휠 반대방향)
{
    // 왼쪽 앞바퀴 전진, 오른쪽 바퀴 후진 -> 우회전
    set_motor_direction(MOTOR_A, FORWARD);   // 왼쪽
    set_motor_direction(MOTOR_B, BACKWARD);  // 오른쪽
    set_motor_speed(MOTOR_A, pwm);
    set_motor_speed(MOTOR_B, pwm);
}

void rotate_left_inplace(uint16_t pwm) // 왼쪽으로 제자리 회전
{
    set_motor_direction(MOTOR_A, BACKWARD);
    set_motor_direction(MOTOR_B, FORWARD);
    set_motor_speed(MOTOR_A, pwm);
    set_motor_speed(MOTOR_B, pwm);
}

/* 간단한 유턴: 제자리 180도 회전 (두번 90도) */
void perform_u_turn(void)
{
    // 180도: 두 번 90도 회전
    rotate_right_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(100);

    rotate_right_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(100);
}

/* 장애물 발견 시 회피 시퀀스:
   1) 정지
   2) 백업(짧게)
   3) 제자리 회전 90도 (우회전)
   4) 전진 (몸체 폭 만큼)
   5) 유턴(180)으로 라인 닫기(옵션)
*/
void R_avoidance_sequence(void)
{
    // 1) 정지
    stop_all_motors();
    HAL_Delay(50);

    // 2) 백업
    move_backward_pwm(BASE_SPEED);
    HAL_Delay(300); // 300ms 뒤로 (조정 필요)
    stop_all_motors();
    HAL_Delay(50);

    // 3) 제자리 우회전 90도
    rotate_right_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 4) 전진으로 통과
    move_forward_pwm(BASE_SPEED);
    HAL_Delay(BODY_MOVE_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 3) 제자리 우회전 90도
        rotate_right_inplace(TURN_SPEED);
        HAL_Delay(TURN_90_TIME_MS);
        stop_all_motors();
        HAL_Delay(50);


}

void L_avoidance_sequence(void)
{
    // 1) 정지
    stop_all_motors();
    HAL_Delay(50);

    // 2) 백업
    move_backward_pwm(BASE_SPEED);
    HAL_Delay(300); // 300ms 뒤로 (조정 필요)
    stop_all_motors();
    HAL_Delay(50);

    // 3) 제자리 좌회전 90도
    rotate_left_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 4) 전진으로 통과
    move_forward_pwm(BASE_SPEED);
    HAL_Delay(BODY_MOVE_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 3) 제자리 좌회전 90도
        rotate_left_inplace(TURN_SPEED);
        HAL_Delay(TURN_90_TIME_MS);
        stop_all_motors();
        HAL_Delay(50);


}




/**
  * @brief 모터 제어를 위해 필요한 초기 설정을 수행합니다.
  * @retval None
  */
void motor_control_init(void)
{
    // 1. PWM 출력 시작 (PA8: ENA, PA9: ENB)
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);



    // 2. 초기 모터 방향 설정 (정지)
    set_motor_direction(MOTOR_A, STOP);
    set_motor_direction(MOTOR_B, STOP);
    set_motor_direction(MOTOR_C, STOP);

    // 3. 초기 모터 속도 설정 (0)
    set_motor_speed(MOTOR_A, 0);
    set_motor_speed(MOTOR_B, 0);
    set_motor_speed(MOTOR_C, 0);

}

void MPU6050_Init(void) {
    uint8_t check;
    uint8_t data;

    // WHO_AM_I register read
    HAL_I2C_Mem_Read(&hi2c1, MPU6050_ADDR, 0x75, 1, &check, 1, 1000);

    if (check == 104) {  // 0x68
        data = 0;
        HAL_I2C_Mem_Write(&hi2c1, MPU6050_ADDR, PWR_MGMT_1, 1, &data, 1, 1000);
        //**자이로 감도 설정 추가(이의주)
        data = 0x18;
        HAL_I2C_Mem_Write(&hi2c1, MPU6050_ADDR, 0x1B, 1, &data, 1, 1000);
        //*
    }
}

void MPU6050_Read_Accel(int16_t *Ax, int16_t *Ay, int16_t *Az) {
    uint8_t Rec_Data[6];
    HAL_I2C_Mem_Read(&hi2c1, MPU6050_ADDR, ACCEL_XOUT_H, 1, Rec_Data, 6, 1000);

    *Ax = (int16_t)(Rec_Data[0] << 8 | Rec_Data[1]);
    *Ay = (int16_t)(Rec_Data[2] << 8 | Rec_Data[3]);
    *Az = (int16_t)(Rec_Data[4] << 8 | Rec_Data[5]);
}

//자이로 데이터 읽기 함수
void MPU6050_Read_Gyro(int16_t *Gx, int16_t *Gy, int16_t *Gz) {
	uint8_t Rec_Data[6];

	// GYRO_XOUT_H (0x43)부터 6바이트 (Gx, Gy, Gz)를 읽어옴
	HAL_I2C_Mem_Read(&hi2c1, MPU6050_ADDR, GYRO_XOUT_H, 1, Rec_Data, 6, 100); // I2C 핸들러 (hi2c1)

	*Gx = (int16_t)(Rec_Data[0] << 8 | Rec_Data[1]);
	*Gy = (int16_t)(Rec_Data[2] << 8 | Rec_Data[3]);
	*Gz = (int16_t)(Rec_Data[4] << 8 | Rec_Data[5]);
}

// 엔코더 카운터 추적 변수 (이전 값과의 차이를 계산하기 위함)
static int prev_enc_L = 0;    // 이전 왼쪽 엔코더 값 (TIM3 카운터)
static int prev_enc_R = 0;    // 이전 오른쪽 엔코더 값 (TIM8 카운터)

/**
  * 엔코더 및 IMU를 이용해 로봇의 현재 위치(x, y, yaw)를 정수 단위로 업데이트합니다.
  */
void update_odometry(void)
{
	const float PI = 3.1415926535f;
	    const int PERIOD = TIMER_PERIOD; // 65536

	    // 1. 엔코더 카운터 값 읽기
	    int current_enc_L = (int)__HAL_TIM_GET_COUNTER(&htim3);
	    int current_enc_R = (int)__HAL_TIM_GET_COUNTER(&htim8);

