euyju/VibeClean/HW/STM32/Core/Src/main.c
	    // 2. 카운터 변화량 계산 (Delta Pulse) - 랩어라운드 처리 적용
	    int delta_L_pulse = current_enc_L - prev_enc_L;
	    int delta_R_pulse = current_enc_R - prev_enc_R;

	    //  랩어라운드 처리
	    if (delta_L_pulse > (PERIOD / 2)) {
	        delta_L_pulse -= PERIOD; // 언더플로우 발생 시
	    } else if (delta_L_pulse < -(PERIOD / 2)) {
	        delta_L_pulse += PERIOD; // 오버플로우 발생 시
	    }

	    if (delta_R_pulse > (PERIOD / 2)) {
	        delta_R_pulse -= PERIOD;
	    } else if (delta_R_pulse < -(PERIOD / 2)) {
	        delta_R_pulse += PERIOD;
	    }

	    prev_enc_L = current_enc_L;
	    prev_enc_R = current_enc_R;

	    // 3. 펄스 변화량을 실제 이동 거리(mm)로 변환
	    float distance_L_mm = (float)delta_L_pulse / ENCODER_RESOLUTION * (2.0f * PI * WHEEL_RADIUS_MM);
	    float distance_R_mm = (float)delta_R_pulse / ENCODER_RESOLUTION * (2.0f * PI * WHEEL_RADIUS_MM);

	    // 평균 이동 거리 및 각도 변화 계산
	    float distance_center_mm = (distance_R_mm + distance_L_mm) / 2.0f;
	    float delta_theta_rad = (distance_R_mm - distance_L_mm) / ROBOT_AXLE_LENGTH_MM; // 회전 각도(엔코더only)

	    // =========================================================================
	    	// [IMU 융합 시작] - 자이로 Yaw 데이터를 엔코더 Yaw에 융합하여 오차 보정
	    	// =========================================================================
	    	int16_t Gx_raw, Gy_raw, Gz_raw;
	    	MPU6050_Read_Gyro(&Gx_raw, &Gy_raw, &Gz_raw);

	    	// 1. Raw Data를 deg/s (DPS)로 변환
	    	float angular_vel_gyro_dps = (float)Gz_raw / MPU6050_GYRO_SCALE;

	    	// 2. DPS를 rad/s로 변환
	    	float angular_vel_gyro_rps = angular_vel_gyro_dps * (PI / 180.0f);

	    	// 3. 자이로 바이어스 제거 (반드시 캘리브레이션 필요!)
	    	angular_vel_gyro_rps -= gyro_bias_Z;

	    	// 4. 자이로 기반의 각도 변화량 (delta_theta_gyro) 계산
	    	float delta_theta_gyro = angular_vel_gyro_rps * ODOMETRY_DT;
	    	// 직접 추가
	    	float delta_theta_enc = (distance_R_mm - distance_L_mm) / ROBOT_AXLE_LENGTH_MM;

	    	// 5. 상보 필터(Complementary Filter)로 융합
	    	// FUSION_ALPHA (예: 0.98)를 자이로에 높게 주어 드리프트를 방지함
	    	float delta_theta_fused = (FUSION_ALPHA * delta_theta_gyro) +
	    	                          ((1.0f - FUSION_ALPHA) * delta_theta_enc);

	        // 기존 엔코더 각도 변화 대신 융합된 각도 변화 사용
	        delta_theta_rad = delta_theta_fused;
	    	// =========================================================================
	    	// [IMU 융합 끝]
	    	// =========================================================================

	    // 4. 좌표 (X, Y) 및 방향 (Yaw) 업데이트 (Middle Point 적분 방식 적용)

	    // 4-1. 현재 Yaw를 라디안으로 변환
	    float current_yaw_rad = g_robot_yaw * PI / 180.0f;

	    // 4-2. 중간 각도 (Average Yaw) 계산: X, Y 계산에 사용 (정확도 향상)
	    float avg_yaw_rad = current_yaw_rad + delta_theta_rad / 2.0f;

	    // 4-3. X, Y 좌표 업데이트
	    float delta_x = distance_center_mm * cosf(avg_yaw_rad);
	    float delta_y = distance_center_mm * sinf(avg_yaw_rad);

	    g_robot_x += delta_x;
	    g_robot_y += delta_y;

	    // 4-4. Yaw 각도 업데이트 및 정규화
	    float next_yaw_rad = current_yaw_rad + delta_theta_rad;
	    g_robot_yaw = next_yaw_rad * 180.0f / PI;

	    // Yaw 각도 정규화 (0~359.999도)
	    while (g_robot_yaw >= 360.0f) g_robot_yaw -= 360.0f;
	    while (g_robot_yaw < 0.0f) g_robot_yaw += 360.0f;
}

//yaw 초기값 조절 함수
void calculate_gyro_bias(void) {
    long long sum_raw = 0;
    const int CAL_COUNT = 1000; // 1000회 측정
    int16_t Gx, Gy, Gz;

    UART_Printf("Starting Gyro Z-axis Calibration (1000 samples)...\r\n");

    // 1. N회 반복하며 Z축 Raw 값 누적
    for (int i = 0; i < CAL_COUNT; i++) {
        MPU6050_Read_Gyro(&Gx, &Gy, &Gz);
        sum_raw += Gz;
        HAL_Delay(5); // 측정 간격 (5ms)
    }

    // 2. 평균 Raw 값 계산 및 DPS 변환
    float avg_raw = (float)sum_raw / CAL_COUNT;
    float avg_dps = avg_raw / MPU6050_GYRO_SCALE;

    // 3. Rad/s 단위로 변환하여 전역 바이어스 변수에 저장
    const float PI = 3.1415926535f;
    gyro_bias_Z = avg_dps * (PI / 180.0f);

    UART_Printf("Calibration Done. Gyro Bias Z: %.5f rad/s\r\n", gyro_bias_Z);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
//Putty 작동 테스트용 변수
	int countL, countR; //  엔코더 카운트 저장 변수
	char debug_msg[100]; // 디버깅 메시지 버퍼

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_I2C1_Init();
  MX_USART3_UART_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  /* USER CODE BEGIN 2 */
  // DWT 초기화 (마이크로초 측정을 위해 필수)
  DWT_Init();
  UART_Printf("STM32 HC-SR04 Measurement Ready (Trig: PA0, Echo: PA1)\r\n");


  motor_control_init(); // <- 반드시 호출 (PWM Start + 초기화)
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

  //엔코더 카운팅 시작
  HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_ALL);
  HAL_TIM_Encoder_Start(&htim8, TIM_CHANNEL_ALL);
  MPU6050_Init(); //초기화
  calculate_gyro_bias();//yaw 초기값 보정

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  int failCount = 0;
  int tempAovoid = 0; // 0 = right, 1 = left

  char post_data_buffer[150]; //json 문자열 버퍼

//
  float d1, d2, d3;
//  int16_t Ax, Ay, Az;
//  char buf[100];
//  // 1️⃣ Wi-Fi 연결
//     ESP_Init("YOUR_WIFI_SSID", "YOUR_WIFI_PASSWORD");
//     char value[64];  // 서버로부터 받은 값을 저장할 버퍼
//
//     // 2️⃣ GET 요청 및 값 파싱
//     if (ESP_HTTP_Get_Value("192.168.178.61", "/api/manual/speed", "fanSpeed", value))
//     {
//         char msg[128];
//         sprintf(msg, "fanSpeed value = %s\r\n", value);
//         Uart_sendstring(msg, &huart2);
//     }
//     else
//     {
//         Uart_sendstring("HTTP GET Failed\r\n", &huart2);
//     }
//
//  // POST
//  ESP_HTTP_Post("192.168.178.61", "/data", "{\"id\":1,\"value\":42}");
//
//  float distance1, distance2, distance3;


  while (1)
  {
     	  //x,y 좌표 확인 Putty 테스트 코드2
	  	  // main 함수 시작부분의 Putty 작동 테스트용 변수와 이하 코드 주석 해제한 후,
	  	  // 이외 while (1) 내용 주석처리 하면 Putty 테스트 가능합니다.
	      // 1. 오도메트리 업데이트 (현재 X, Y, Yaw 계산)
	      update_odometry();

	      // 2. 시리얼 포트로 X, Y 좌표 출력 (테스트용)
	      // float 값을 소수점 두 자리까지 출력하여 정확도를 확인합니다.
	      sprintf(debug_msg, "X: %.2f | Y: %.2f | Yaw: %.1f\r\n",
	              g_robot_x, g_robot_y, g_robot_yaw);
	      UART_Printf(debug_msg);
	      HAL_Delay(100); // ms마다 업데이트 확인



